'=====GIT====='
# это распределенная система контроля версийййй (это система, записывающая изменения в файл или наоборот файлов в течении времени). Предназначена для отслеживания и ведения истории изменения файлов, в вашем проекте

'=====GITHUB====='
# Это сайт куда я могу отправить все что находтся на моем ноутбуке, чтобы другие люди могли просматривать мой код и мой прогресс, так же использовать моййй код

'Репозиторий'
# Хранилище проекта

# 1.локальный (на ноутбуке)
# 2.удаленный (на каком то сервисе, который предоставляет репозиторий (GITHUB))

 